module.exports = {
    Owners: ["412629615081684992", "1196111143245189183"], // الاونرات
    RoleCoOwner: '1459939328611582179',
    BankID: '412629615081684992',
    Probot: '1006086863599190077',
    red: 'http://localhost:5000',
    port: 5000,
    prefix: '-',
    لون_الامبيد: '#acb6c4',
    RommsShop: ["1459941987745530170", "1459941982498717899", "1459941977733992580", "1459941972000116951", "1459941967143239876", "1459941960419901574", "1459941955730407657", "1459941950881796334", "", "", "", "", ""], // هنا تحط ايدي الشعوب لو دول كتير امسح الزياده
    filterEnabled: false,

    bannedWords: [
        "متجر", "حساب", "بيع", "شراء", "شوب", "ديسكورد", "سعر", "متوفر", "بوست",
        "نيترو", "توكنات"
    ],

    wordReplacements: {
        "متجر": "متـgـر",
        "حساب": "7ـساب",
        "بيع": "بـيـ3",
        "شراء": "شـrـراء",
        "شوب": "شـ9ب",
        "ديسكورد": "ديسـkورد",
        "سعر": "سـ3ـر",
        "متوفر": "متـ9فر",
        "بوست": "بـ9ست",
        "نيترو": "نيـtـرو",
        "توكنات": "تـ9ـكنات"
    },
    RBPrefix: 'ꜱᴏ',
    Rooms: {
        AuctionRoom: '1460276328669515879',
        PublishedAuctions: '1460276328669515879',
        RoomAds: '',
        RoomPosts: '1459941945878253652',
        CeatogryPrivteRooms: '1459940259717714072',
        Giftsad: '',
        Firstadcatagory: '',
        CeatogryPrivteRoomad: '1459940259717714072',
        LogRoles: '1459942475392225385',
        Logmzad: '1459943630281244837',
        LogPosts: '1459942531260350546',
        LogAds: '1459943646848745584',
        LogBlacklist: '1466338457235230791',
        LogSpins: '1459943653542727844',
        LogPrivteRooms: '1459943635050041582',
        LogTranscreipt: '1459942503833665757',
        Logscammers: '1459943653542727844',
        LogOrders: '1459943653542727844',
        WinLog: '1459943653542727844',
        Warns: '1459941933018251264',
        Orders: '1459940280848613550',
        Sug: '1459942030410121236',
        Feedback: '1459942052409114769',
        Tax: '1459942035057414214'

    },
    Tickets: {
        TicketSupport: true,
        TicketComplain: true,
        TicketsKdaa: true,
        TicketsMzad: true
    },

    ReportSettings: {
        ReportButtonRoleID: '1042876000771506316',
        ChannelID: '1217163888727031920'

    },
    BroadCast: {
        Tokens: ["لا تلعب فيها"],
    },
    CetagryTicket: {
        support: '1459940275316068405',
        Tasher: '1459940285806018766',
        Mzad: '1459940301715275816',
        complain: '1459940285806018766',
        spin: '1459940290998833263'
    },
    Admins: {
        DiscordStaff: '1459939698846990667',
        DiscordLeader: '1459939523499655189',
        Kdaa: '1459939770708000942',
        Mzad: '1459939698846990667',
        RoleControl: '1459939682400866395'
    },
    Wasset: {
        wasset1cat: '1382088486902825151',
        wasset2cat: '1382088617752662076',
        wasset3cat: '1382088664905027727',
        wasset4cat: '1382088702146248744',
        wasset5cat: '1382088731577811045'
    },
    ServerInfo: {
        serverID: '1449742136600690822',
        serverName: 'SoW',
        line: 'https://i.postimg.cc/FKKsx1rL/Untitled557-20251104190046.png',
        ApplyImage: 'https://i.postimg.cc/767Jrbp1/Untitled553-20251104173934.png',
        Orders: 'https://i.postimg.cc/rwJ97ZS1/IMG-9519.png',
        tashfer: 'https://i.postimg.cc/2jVXhYnt/IMG-9523.png',
        TicketImage: 'https://i.postimg.cc/pT2QCf9p/Untitled553-20251104174502.png',
        ScamImage: 'https://media.discordapp.net/attachments/1237979197973069844/1279068646446075914/ap.png?ex=67a60901&is=67a4b781&hm=deb53d8db3d844878f99bc56cd5addbbd5a92b8d24694c59d6e77b56b8b2e38e&',
    },
    Apply: {
        MasoulKbool: '1196111143245189183',
        staff: {
            Room: '1459941884846805204',
            Role: '1459939698846990667',
            type: true, //هنا تحطها true لو عايز تفتح التقديم
        },
        Kdaa: {
            Room: '1459941891188719799',
            Role: '1459939762784702736',
            type: true,
        },
        Waset: {
            Room: '1459941884846805204',
            Role: '1459939698846990667',
            type: false,
        },
    },
    Fa7s: {
        staff: {
            ticket: 2500,
            warn: 1500,
        },
        Kdaa: {
            ticket: 4000,
        }
    },
    AutoLine: [
        "هنا تحط ايدي الرومات الي محتاج فيها اوتو لاين",
        "1459941950881796334",
        "1459941955730407657",
        "1459941960419901574",
        "1459941967143239876",
        "1459941972000116951",
        "1459941977733992580",
        "1459941982498717899",
        "1459941987745530170"
    ],
    blacklist: {
        staff: '1459940011108601972',
        mazad: '1459940002191376435',
        tickets: '1459940006486609987',
    },
    Close_Open: {
        log: 'ايدي الروم يلي يرسل فيها الحاجة',
        refresh: true,
        Rooms: [
            "هنا تحط ايدي الرومات الي يقفل و يفتح رومات الشوب",
            "1459941950881796334",
            "1459941955730407657",
            "1459941960419901574",
            "1459941967143239876",
            "1459941972000116951",
            "1459941977733992580",
            "1459941982498717899",
            "1459941987745530170"
        ]

    },


    Orders: {
        montgat: {
            role: '1466344467694096477',
            room: '1460309829661888718',
        },
        tsamem: {
            role: '1466344545066422292',
            room: '1460309555236831399',
        },
        devss: {
            role: '1466344256330535024',
            room: '1460309829661888718',
        },
    },

    // --- رواتب الإدارة (Staff Roles) ---
    // يمكنك إضافة الرتب التي تود ظهورها في أمر -اداره هنا
    StaffRoles: [
        { label: 'إدارة صغرى', roleId: '1459939698846990667' },
        { label: 'تحت التجربة', roleId: '1459939694950219838' },
    ],
    StaffPerms: [
        { label: 'صلاحيات منشورات', roleId: '1459939665275519103' },
        { label: 'صلاحيات رول', roleId: '1459939682400866395' },
    ],
};
